#+TITLE: NixOS on a Raspberry Pi
#+AUTHOR: Kyle M. Douglass
#+DATE: 2020-08-21

#+BEGIN_ABSTRACT
I describe how to install and set up NixOS on a Raspberry Pi 3B+.
#+END_ABSTRACT

** Determine the device file for the SD card

 I often use the last few lines from =dmesg= to get the device file of the SD card immediately after
 I plug it in to my laptop. Here I am viewing the ten most recent messages from the kernel after
 having plugged it in:

 #+BEGIN_SRC sh :results output :session nixos
 dmesg | tail -n 10
 #+END_SRC

 #+RESULTS:
 #+begin_example
 [ 2133.088101] alx 0000:3e:00.0: AER: PCIe Bus Error: severity=Corrected, type=Data Link Layer, (Receiver ID)
 [ 2133.088109] alx 0000:3e:00.0: AER:   device [1969:e0b1] error status/mask=00000080/00002000
 [ 2133.088115] alx 0000:3e:00.0: AER:    [ 7] BadDLLP
 [ 2138.016884] EXT4-fs (mmcblk0p2): mounted filesystem with ordered data mode. Opts: (null)
 [ 2138.039932] sd 4:0:0:0: ioctl_internal_command return code = 8000002
 [ 2138.039934] sd 4:0:0:0: Sense Key : No Sense [current]
 [ 2138.039935] sd 4:0:0:0: Add. Sense: Medium not present
 [ 2143.048626] sd 4:0:0:0: ioctl_internal_command return code = 8000002
 [ 2143.048628] sd 4:0:0:0: Sense Key : No Sense [current]
 [ 2143.048630] sd 4:0:0:0: Add. Sense: Medium not present
 #+end_example

 From the above, I can infer that the device file contains the characters =mmcblk=. I can also
 infer that a file system already exists on the SD card because of the contents of the message and
 the characters =p2= indicate a second partition.

 To verify that this is indeed the device, I first unplug it from my laptop and run the below
 command:

 #+BEGIN_SRC sh :results output :session nixos
 ls /dev | grep mmcblk
 #+END_SRC

 #+RESULTS:

 There are no devices containing these characters. Plugging in the card and rerunning the command
 produces the following:

 #+BEGIN_SRC sh :results output :session nixos
 ls /dev | grep mmcblk
 #+END_SRC

 #+RESULTS:
 : mmcblk0
 : mmcblk0p1
 : mmcblk0p2

** Zero the SD card

Since the card already contains a file system, I will go ahead and set all the bytes to zero. This
step likely is not necessary, but it will help to ensure that I start from a clean slate and avoid
any possible errors that might arise from not doing so.[fn:1]

#+BEGIN_SRC sh :results output :session nixos :dir /sudo::
dd if=/dev/zero of=/dev/mmcblk0 bs=5M
sync
#+END_SRC

#+RESULTS:
#+begin_example
dd: error writing '/dev/mmcblk0': No space left on device
29665+0 records in
29664+0 records out
31104958464 bytes (31 GB, 29 GiB) copied, 2234.21 s, 13.9 MB/s
#+end_example

Once zeroed, I copy the image to the SD card in a similar manner.

#+BEGIN_SRC sh :results output :session nixos :dir /sudo::
dd if=/home/kmdouglass/Downloads/nixos-sd-image-20.03.2665.274831839c4-aarch64-linux.img of=/dev/mmcblk0 bs=5M
sync
#+END_SRC

#+RESULTS:
: 542+1 records in
: 542+1 records out
: 2841923584 bytes (2.8 GB, 2.6 GiB) copied, 231.494 s, 12.3 MB/s

